<?php
/**
 * About
 *
 * */
defined('_JOOS_CORE') or die();
?>
<div class="m-about b-info">
    <p>В первую очередь, Joostina - это русскоязычный OpenSource-проект, развивающийся силами безгранично любящих его
        людей. А во вторую очередь - это <strong>профессиональная, быстрая и современная система управления
            сайтами</strong>.</p>

    <p>В процессе развития, мы пытаемся поддерживать систему в состоянии, когда она:</p>
    <ul>
        <li>одинаково удобна как для пользователей, так и для разработчиков;</li>
        <li>универсальна не в ущерб скорости работы</li>
        <li>оптимизирована под нагрузки и готова с радостной улыбкой встретить тысячи посетителей</li>
    </ul>
</div>